load_test_scenario.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Phase 1: Warm up"
    - duration: 20
      arrivalRate: 10
      rampTo: 30
      name: "Phase 2: Ramp up load"
    - duration: 20
      arrivalRate: 30
      name: "Phase 3: Sustained peak load"
  
  # Ensure the test fails if error rate is too high or latency is too slow
  ensure:
    p95: 500
    maxErrorRate: 5

scenarios:
  - name: "Basic Health Check"
    weight: 5
    flow:
      - get:
          url: "/"

  - name: "Authentication Failure Test (Invalid Login)"
    weight: 2
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "nonexistent@gmail.com"
            password: "WrongPassword123!"
          # We expect a 400 status code here, so we tell artillery it's fine
          expect:
            - statusCode: 400

  - name: "Simulated User Flow (Signup/Login attempt)"
    weight: 1
    flow:
      - post:
          url: "/auth/signup"
          json:
            name: "Load Test User"
            email: "loadtest_{{ $randomString() }}@gmail.com"
            password: "LoadTest123!@#"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1
      - get:
          url: "/chat/list"
          headers:
            Authorization: "Bearer {{ authToken }}"